ХМНПФ_Общее/Documents/уп_ПриостановкаВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПриостановкаВыплат</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПриостановки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПричинаПриостановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПричиныПриостановок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачислятьЗаПрошедшиеПериоды</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВосстановления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныеОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыОперацийПриостановкаНПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_СправкаОбИнвалидности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПриостановки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ВосстановлениеВыплатПослеПриостановки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Задолженность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СхемаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СхемаСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПериодичностьВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПериодичностьВыплат</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодичностьВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ПериодичностьВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоличествоНазначенныхВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоличествоНазначенныхВыплат</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_СчетчикНачислений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СчетчикНачислений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/хм_СрезСчетчикНачисленийНПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>хм_СрезСчетчикНачисленийНПО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ДатыСледующихВыплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ДатыСледующихВыплат</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСледующейВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ДатыОкончанияСрочнойВыплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ДатыОкончанияСрочнойВыплаты</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияСрочнойВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ВосстановлениеВыплатПослеПриостановки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВосстановлениеВыплатПослеПриостановки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БезКомпенсации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СКомпенсацией</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ПриостановкаВыплат/Ext/ObjectModule.bsl
&После("ОбработкаЗаполнения")
Процедура НПФ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения.Свойство("Основание")  Тогда
		
		Организация = ДанныеЗаполнения.Основание.Организация;
		
		Для Каждого Стр Из ДанныеЗаполнения.Основание.СписокСчетов Цикл
			
			Участник =  Стр.Участник;
			//ДатаНачала
			
			нСтрока = СписокСчетов.Добавить();
			
			нСтрока.НомерСчета = Стр.НомерСчета;
			нСтрока.ПенсионныйДоговор = Стр.ПенсионныйДоговор;
			
			Прервать;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

Процедура ХМ_НеТиповыеИзменения()
	// ХМНПФ+ 22.08.2016 ШадринАВ // длина номера изменена с 9 до 18 // №459
	// ХМНПФ 16.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
КонецПроцедуры

// ХМНПФ 16.02.2017 ШадринАВ // Новая ХМ_ЗАГРУЗКА_ОбработкаПроведения() // №779
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ, СтруктураТЧ) Экспорт
	Если Проведен Тогда
		ОбработкаПроведения(Отказ, Режим);
	Иначе
		ОбработкаУдаленияПроведения(Отказ)
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура ХМОбработкаПроведения(Отказ, Режим)
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Проверка ручной корректировки
	Если уп_ОсновнаяПоставкаСервер.РучнаяКорректировкаОбработкаПроведения(РучнаяКорректировка,Отказ,Заголовок,ЭтотОбъект,Ложь) Тогда
		Возврат
	КонецЕсли;
	
	Отказ = Проверка(Заголовок);
	Для Каждого ТекСтрокаСписоксчетов Из Списоксчетов Цикл
		// регистр СостоянияПС 
		Если ЗначениеЗаполнено(ДатаНачала) Тогда
			СрезСостояний = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(ДатаНачала-1,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета));
#Вставка
			//https://redmine.npf.com/issues/4309
			СрезСостояний = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(Дата-1,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета));
#КонецВставки
			ТекСостояние = СрезСостояний.Состояние;
#Вставка
			хм_ДополнительныйКонтроль = РегистрыСведений.хм_ДополнительныйКонтроль.ПолучитьПоследнее(Дата);
			Если хм_ДополнительныйКонтроль.Приостановка_КонтрольСтатуса = Ложь Тогда
				ТекСостояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
			КонецЕсли;
			
#КонецВставки
			Если ТекСостояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод Тогда
				Движение = Движения.уп_СостоянияПС.Добавить();
				Движение.Период = НачалоДня(ДатаНачала);
#Вставка
				//https://redmine.npf.com/issues/4309
				Движение.Период = Дата;
				Движение.ДатаУстановкиСостояния = НачалоДня(ДатаНачала);
#КонецВставки
				Движение.НомерСчета = ТекСтрокаСписоксчетов.НомерСчета;
				Если ТипПриостановки = 0 Тогда
					Движение.Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены;
				Иначе
					Движение.Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены;
				КонецЕсли; 
				Движение.Основание = СрезСостояний.Основание;
				Движение.ДатаОкончанияОснований = СрезСостояний.ДатаОкончанияОснований;
			Иначе
				Отказ = Истина;
				//ОПА НПО 2017.12.28 + 
				//Сообщить("По пенсионному счету №"+ТекСтрокаСписоксчетов.НомерСчета.Код+" выплаты не могут быть приостановлены, т.к. счет не в выплатном периоде.")
				Сообщить("По пенсионному счету №"+ТекСтрокаСписоксчетов.НомерСчета+" выплаты не могут быть приостановлены, т.к. счет не в выплатном периоде.");
				//ОПА НПО 2017.12.28 - 
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ДатаКонца) Тогда
			СрезСостояний = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(ДатаКонца-1,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета));
			ТекСостояние = СрезСостояний.Состояние;
#Вставка
			хм_ДополнительныйКонтроль = РегистрыСведений.хм_ДополнительныйКонтроль.ПолучитьПоследнее(Дата);
			Если хм_ДополнительныйКонтроль.Приостановка_КонтрольСтатуса = Ложь Тогда
				ТекСостояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены;
			КонецЕсли;
#КонецВставки
			Если (ТекСостояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены)
				или (ТекСостояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод) или (ТекСостояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены) Тогда
				Если ВидОперации = Перечисления.уп_ВидыОперацийПриостановкаНПО.ОтменаПриостановки Тогда
					ДатаДвижения = КонецДня(Дата);
				Иначе
					ДатаДвижения = КонецДня(ДатаКонца);
				КонецЕсли;	
#Вставка
				Движение.ДатаДвижения = Дата;
#КонецВставки
				Движение = Движения.уп_СостоянияПС.Добавить();
				Движение.Период = ДатаДвижения;
				Если НачислятьЗаПрошедшиеПериоды Тогда
					Движение.ДатаУстановкиСостояния = ДатаВосстановления;
				Иначе
					Движение.ДатаУстановкиСостояния = ДатаКонца;
				КонецЕсли;
				Движение.НомерСчета = ТекСтрокаСписоксчетов.НомерСчета;
				Движение.Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
				Если ЗначениеЗаполнено(ПенсионныеОснования) Тогда
					Движение.Основание = ПенсионныеОснования;
					Движение.ДатаОкончанияОснований = ДатаОкончанияОснований; 
				Иначе
					//берем из последней записи 
					Движение.Основание = СрезСостояний.Основание;
					Движение.ДатаОкончанияОснований = СрезСостояний.ДатаОкончанияОснований;
				КонецЕсли;	
			Иначе
				Отказ = Истина;
				//ОПА НПО 2017.12.28 + 
				//Сообщить("По пенсионному счету №"+ТекСтрокаСписоксчетов.НомерСчета.Код+" выплаты не могут быть восстановлены, т.к. счет не в выплатном периоде.")
				Сообщить("По пенсионному счету №"+ТекСтрокаСписоксчетов.НомерСчета+" выплаты не могут быть восстановлены, т.к. счет не в выплатном периоде.");
				//ОПА НПО 2017.12.28 - 
			КонецЕсли;
		КонецЕсли;
		
		//ОПА НПО 2018.06.18 +
		//регистры ДатыСледующихВыплат, ДатыОкончанияСрочныхВыплат
		Если ВидОперации = Перечисления.уп_ВидыОперацийПриостановкаНПО.ОтменаПриостановки Тогда
			ДанныеСхемы = РегистрыСведений.уп_СхемаСчета.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета));
			лТекСхема = ДанныеСхемы.Схема;
			Если ТекСтрокаСписоксчетов.ТипПриостановки = Перечисления.уп_ВосстановлениеВыплатПослеПриостановки.БезКомпенсации Тогда
				
				ДанныеПериодичности = РегистрыСведений.уп_ПериодичностьВыплат.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета));
				лТекПериодичностьВыплат = ДанныеПериодичности.ПериодичностьВыплат;
				лНомерМесяцаВПериоде = ДанныеПериодичности.НомерМесяцаВПериоде;
				лТекНазначеноВыплат = РегистрыСведений.уп_КоличествоНазначенныхВыплат.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета)).КоличествоВыплат;
				ТЗНачисленоВыплат = РегистрыНакопления.уп_СчетчикНачислений.Обороты(,Дата,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета),"НомерСчета","Количество");
#Вставка
//++https://redmine.npf.com/issues/4274
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	уп_СчетчикНачислений.НомерСчета КАК НомерСчета,
			                      |	МАКСИМУМ(ЕСТЬNULL(хм_СрезСчетчик.Количество, 0)) + СУММА(ВЫБОР
			                      |			КОГДА хм_СрезСчетчик.ДатаУстановкиСостояния ЕСТЬ NULL
			                      |				ТОГДА ЕСТЬNULL(уп_СчетчикНачислений.Количество, 0)
			                      |			ИНАЧЕ 0
			                      |		КОНЕЦ) КАК Количество
			                      |ИЗ
			                      |	РегистрНакопления.уп_СчетчикНачислений КАК уп_СчетчикНачислений
			                      |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.хм_СрезСчетчикНачисленийНПО.СрезПоследних(&Дата, НомерСчета В (&СписокСчетов)) КАК хм_СрезСчетчик
			                      |		ПО уп_СчетчикНачислений.НомерСчета = хм_СрезСчетчик.НомерСчета
			                      |			И уп_СчетчикНачислений.Период < хм_СрезСчетчик.ДатаУстановкиСостояния
			                      |ГДЕ
			                      |	уп_СчетчикНачислений.Период <= &Дата
			                      |	И уп_СчетчикНачислений.НомерСчета В (&СписокСчетов)
			                      |
			                      |СГРУППИРОВАТЬ ПО
			                      |	уп_СчетчикНачислений.НомерСчета");
			Запрос.УстановитьПараметр("СписокСчетов",ТекСтрокаСписоксчетов.НомерСчета);
			Запрос.УстановитьПараметр("Дата",Дата); 
			ТЗНачисленоВыплат = Запрос.Выполнить().Выгрузить();
#КонецВставки
				лТекНачисленоВыплат = ?(ТЗНачисленоВыплат.Количество()=0, 0, ТЗНачисленоВыплат[0].Количество);
				лТекКоличествоВыплат = лТекНазначеноВыплат - лТекНачисленоВыплат;
				ДанныеНомераОчереди = РегистрыСведений.уп_НомераОчередей.ПолучитьПоследнее(Дата,Новый Структура("НомерСчета",ТекСтрокаСписоксчетов.НомерСчета));
				ДанныеОчереди = РегистрыСведений.уп_ДатыОчередей.Получить(Новый Структура("НомерОчереди", ДанныеНомераОчереди.НомерОчереди));
				
				Движение = Движения.уп_ДатыСледующихВыплат.Добавить();
				Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
				Движение.Период = Дата;
				лДатаСледующейВыплаты = ОпределитьДатуСледующейВыплаты(ДатаКонца, лТекПериодичностьВыплат, лНомерМесяцаВПериоде, ДанныеОчереди);
				Движение.ДатаСледующейВыплаты = лДатаСледующейВыплаты;
				
				Если лТекСхема.ТипПенсионнойСхемы = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат
					ИЛИ ДанныеСхемы.ТипПенсии = Перечисления.уп_ТипыПенсионныхСхем.СрочныхВыплат Тогда
					Движение = Движения.уп_ДатыОкончанияСрочнойВыплаты.Добавить();
					Движение.НомерСчета = ТекСтрокаСписокСчетов.НомерСчета;
					Движение.Период = Дата;
					Если лТекПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежегодно Тогда
						лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(лДатаСледующейВыплаты),лТекКоличествоВыплат*12)-1;	
					ИначеЕсли лТекПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Полугодие Тогда
						лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(лДатаСледующейВыплаты),лТекКоличествоВыплат*6)-1;
					ИначеЕсли лТекПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежеквартально Тогда
						лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(лДатаСледующейВыплаты),лТекКоличествоВыплат*3)-1;	
					ИначеЕсли лТекПериодичностьВыплат = Перечисления.уп_ПериодичностьВыплат.Ежемесячно Тогда
						лДатаОкончанияСрочнойВыплаты = ДобавитьМесяц(НачалоМесяца(лДатаСледующейВыплаты),лТекКоличествоВыплат)-1;	
					КонецЕсли;
					Движение.ДатаОкончанияСрочнойВыплаты = лДатаОкончанияСрочнойВыплаты;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		//ОПА НПО 2018.06.18 -
	КонецЦикла;
	
	//списать задолженность за период отсутствия пенсионных оснований
	Если ВидОперации = Перечисления.уп_ВидыОперацийПриостановкаНПО.ОтменаПриостановки Тогда
		Если ПричинаПриостановки = Справочники.уп_ПричиныПриостановок.ОкончаниеПенсионныхОснований Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	уп_ЗадолженностьПоПенсиямОстатки.НомерСчета КАК НомерСчета,
			|	уп_ЗадолженностьПоПенсиямОстатки.НачалоПериода КАК НачалоПериода,
			|	уп_ЗадолженностьПоПенсиямОстатки.КонецПериода КАК КонецПериода,
			|	уп_ЗадолженностьПоПенсиямОстатки.СуммаПенсииОстаток КАК СуммаПенсии,
			|	уп_ЗадолженностьПоПенсиямОстатки.СуммаДоплатыОстаток КАК СуммаДоплаты,
			|	уп_ЗадолженностьПоПенсиямОстатки.СчетчикОстаток КАК Счетчик,
			|	&ДатаДвижений КАК Период
			|ПОМЕСТИТЬ Задолженность
			|ИЗ
			|	РегистрНакопления.уп_ЗадолженностьПоПенсиям.Остатки(
			|			&ДатаДок,
			|			НомерСчета В (&СписокСчетов)
			|				И НачалоПериода < &ДатаВосстановления) КАК уп_ЗадолженностьПоПенсиямОстатки
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	уп_ПериодичностьВыплатСрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_ПериодичностьВыплатСрезПоследних.ПериодичностьВыплат КАК ПериодичностьВыплат
			|ПОМЕСТИТЬ Периодичности
			|ИЗ
			|	РегистрСведений.уп_ПериодичностьВыплат.СрезПоследних(&ДатаДвижений, НомерСчета В (&СписокСчетов)) КАК уп_ПериодичностьВыплатСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Задолженность.НомерСчета КАК НомерСчета,
			|	Задолженность.НачалоПериода КАК НачалоПериода,
			|	Задолженность.КонецПериода КАК КонецПериода,
			|	Задолженность.СуммаПенсии КАК СуммаПенсии,
			|	Задолженность.СуммаДоплаты КАК СуммаДоплаты,
			|	Задолженность.Счетчик КАК Счетчик,
			|	Задолженность.Период КАК Период,
			|	Периодичности.ПериодичностьВыплат КАК ПериодичностьВыплат
			|ИЗ
			|	Задолженность КАК Задолженность
			|		ЛЕВОЕ СОЕДИНЕНИЕ Периодичности КАК Периодичности
			|		ПО Задолженность.НомерСчета = Периодичности.НомерСчета";
			Если НачислятьЗаПрошедшиеПериоды Тогда
				Запрос.УстановитьПараметр("ДатаВосстановления", НачалоДня(ДатаВосстановления));
			Иначе
				Запрос.УстановитьПараметр("ДатаВосстановления", НачалоДня(Дата));
			КонецЕсли;
			Запрос.УстановитьПараметр("ДатаДок", Новый Граница(МоментВремени(),ВидГраницы.Исключая));
			Запрос.УстановитьПараметр("СписокСчетов", СписокСчетов.ВыгрузитьКолонку("НомерСчета"));
			Запрос.УстановитьПараметр("ДатаДвижений", Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если НачислятьЗаПрошедшиеПериоды Тогда
					ДатаНачалаПериода = уп_НПФ.ОпределитьДатуНачалаПериода(ДатаВосстановления, ВыборкаДетальныеЗаписи.ПериодичностьВыплат);
					Если ВыборкаДетальныеЗаписи.НачалоПериода<ДатаНачалаПериода Тогда
						Движение = Движения.уп_ЗадолженностьПоПенсиям.ДобавитьРасход();
						ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
					КонецЕсли;	
				Иначе 
					Движение = Движения.уп_ЗадолженностьПоПенсиям.ДобавитьРасход();
					ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры
